*** crates/aion-trust-claims/src/claim.rs:134:37: replace != with == in Claim::verify

*** mutation diff:
--- crates/aion-trust-claims/src/claim.rs
+++ replace != with == in Claim::verify
@@ -126,17 +126,17 @@
 
     pub fn claim_id(&self) -> &ClaimId {
         &self.claim_id
     }
 
     /// Verify this claim against the issuer's trusted key. On success returns a
     /// [`VerifiedClaim`] — the only way to read the body.
     pub fn verify(&self, issuer_vk: &VerifyingKey) -> Result<VerifiedClaim, ClaimReject> {
-        if Did::from_key(issuer_vk) != self.issuer_id {
+        if Did::from_key(issuer_vk) == /* ~ changed by cargo-mutants ~ */ self.issuer_id {
             return Err(ClaimReject::IssuerKeyMismatch);
         }
         let body_hash = hash_body(&self.body)?;
         if to_hex(&body_hash) != self.body_hash {
             return Err(ClaimReject::BodyTampered);
         }
         let signing = signing_bytes(
             &self.subject_id,

---- claim_outside_its_validity_window_is_rejected stdout ----

thread 'claim_outside_its_validity_window_is_rejected' (159888) panicked at crates/aion-trust-claims/tests/adversarial.rs:160:5:
assertion failed: failed(&r, "claim within validity")

---- happy_path_is_accepted stdout ----

thread 'happy_path_is_accepted' (159891) panicked at crates/aion-trust-claims/tests/adversarial.rs:56:5:

---- json_round_trip_still_verifies stdout ----

thread 'json_round_trip_still_verifies' (159892) panicked at crates/aion-trust-claims/tests/adversarial.rs:66:5:

failures:
    claim_outside_its_validity_window_is_rejected
    happy_path_is_accepted
    json_round_trip_still_verifies

test result: FAILED. 7 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
