*** crates/aion-trust-claims/src/claim.rs:138:31: replace != with == in Claim::verify

*** mutation diff:
--- crates/aion-trust-claims/src/claim.rs
+++ replace != with == in Claim::verify
@@ -130,17 +130,17 @@
 
     /// Verify this claim against the issuer's trusted key. On success returns a
     /// [`VerifiedClaim`] — the only way to read the body.
     pub fn verify(&self, issuer_vk: &VerifyingKey) -> Result<VerifiedClaim, ClaimReject> {
         if Did::from_key(issuer_vk) != self.issuer_id {
             return Err(ClaimReject::IssuerKeyMismatch);
         }
         let body_hash = hash_body(&self.body)?;
-        if to_hex(&body_hash) != self.body_hash {
+        if to_hex(&body_hash) == /* ~ changed by cargo-mutants ~ */ self.body_hash {
             return Err(ClaimReject::BodyTampered);
         }
         let signing = signing_bytes(
             &self.subject_id,
             &self.issuer_id,
             &self.claim_type,
             &self.schema_id,
             &self.validity,

---- happy_path_is_accepted stdout ----

thread 'happy_path_is_accepted' (160092) panicked at crates/aion-trust-claims/tests/adversarial.rs:56:5:

---- claim_outside_its_validity_window_is_rejected stdout ----

thread 'claim_outside_its_validity_window_is_rejected' (160089) panicked at crates/aion-trust-claims/tests/adversarial.rs:160:5:
assertion failed: failed(&r, "claim within validity")

---- json_round_trip_still_verifies stdout ----

thread 'json_round_trip_still_verifies' (160093) panicked at crates/aion-trust-claims/tests/adversarial.rs:66:5:

failures:
    claim_outside_its_validity_window_is_rejected
    happy_path_is_accepted
    json_round_trip_still_verifies

test result: FAILED. 7 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
