*** crates/aion-trust-claims/src/claim.rs:149:50: replace != with == in Claim::verify

*** mutation diff:
--- crates/aion-trust-claims/src/claim.rs
+++ replace != with == in Claim::verify
@@ -141,17 +141,17 @@
         let signing = signing_bytes(
             &self.subject_id,
             &self.issuer_id,
             &self.claim_type,
             &self.schema_id,
             &self.validity,
             &body_hash,
         );
-        if ClaimId::from_signing_bytes(&signing) != self.claim_id {
+        if ClaimId::from_signing_bytes(&signing) == /* ~ changed by cargo-mutants ~ */ self.claim_id {
             return Err(ClaimReject::ClaimIdMismatch);
         }
         let sig = decode_array::<64>(&self.issuer_signature).map_err(|_| ClaimReject::Malformed)?;
         issuer_vk
             .verify(&signing, &sig)
             .map_err(|_| ClaimReject::BadSignature)?;
         Ok(VerifiedClaim(self.clone()))
     }

---- claim_outside_its_validity_window_is_rejected stdout ----

thread 'claim_outside_its_validity_window_is_rejected' (160359) panicked at crates/aion-trust-claims/tests/adversarial.rs:160:5:
assertion failed: failed(&r, "claim within validity")

---- happy_path_is_accepted stdout ----

thread 'happy_path_is_accepted' (160362) panicked at crates/aion-trust-claims/tests/adversarial.rs:56:5:

---- json_round_trip_still_verifies stdout ----

thread 'json_round_trip_still_verifies' (160363) panicked at crates/aion-trust-claims/tests/adversarial.rs:66:5:

failures:
    claim_outside_its_validity_window_is_rejected
    happy_path_is_accepted
    json_round_trip_still_verifies

test result: FAILED. 7 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
