*** crates/aion-trust-claims/src/claim.rs:184:9: replace VerifiedClaim::active_at -> bool with true

*** mutation diff:
--- crates/aion-trust-claims/src/claim.rs
+++ replace VerifiedClaim::active_at -> bool with true
@@ -176,17 +176,17 @@
     pub fn validity(&self) -> &Validity {
         &self.0.validity
     }
     /// The trusted body — reachable only after verification.
     pub fn body(&self) -> &EmploymentBody {
         &self.0.body
     }
     pub fn active_at(&self, now: Timestamp) -> bool {
-        self.0.validity.active_at(now)
+        true /* ~ changed by cargo-mutants ~ */
     }
 }
 
 fn hash_body(body: &EmploymentBody) -> Result<[u8; 32], ClaimReject> {
     let bytes = serde_json::to_vec(body).map_err(|_| ClaimReject::Malformed)?;
     Ok(crypto::hash(&bytes))
 }

---- claim_outside_its_validity_window_is_rejected stdout ----

thread 'claim_outside_its_validity_window_is_rejected' (160656) panicked at crates/aion-trust-claims/tests/adversarial.rs:159:5:
assertion failed: !r.accepted

failures:
    claim_outside_its_validity_window_is_rejected

test result: FAILED. 9 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
