*** crates/aion-trust-claims/src/claim.rs:184:9: replace VerifiedClaim::active_at -> bool with false

*** mutation diff:
--- crates/aion-trust-claims/src/claim.rs
+++ replace VerifiedClaim::active_at -> bool with false
@@ -176,17 +176,17 @@
     pub fn validity(&self) -> &Validity {
         &self.0.validity
     }
     /// The trusted body — reachable only after verification.
     pub fn body(&self) -> &EmploymentBody {
         &self.0.body
     }
     pub fn active_at(&self, now: Timestamp) -> bool {
-        self.0.validity.active_at(now)
+        false /* ~ changed by cargo-mutants ~ */
     }
 }
 
 fn hash_body(body: &EmploymentBody) -> Result<[u8; 32], ClaimReject> {
     let bytes = serde_json::to_vec(body).map_err(|_| ClaimReject::Malformed)?;
     Ok(crypto::hash(&bytes))
 }

---- happy_path_is_accepted stdout ----

thread 'happy_path_is_accepted' (160863) panicked at crates/aion-trust-claims/tests/adversarial.rs:56:5:

---- json_round_trip_still_verifies stdout ----

thread 'json_round_trip_still_verifies' (160864) panicked at crates/aion-trust-claims/tests/adversarial.rs:66:5:

failures:
    happy_path_is_accepted
    json_round_trip_still_verifies

test result: FAILED. 8 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
