*** crates/aion-trust-claims/src/claim.rs:189:5: replace hash_body -> Result<[u8; 32], ClaimReject> with Ok([1; 32])

*** mutation diff:
--- crates/aion-trust-claims/src/claim.rs
+++ replace hash_body -> Result<[u8; 32], ClaimReject> with Ok([1; 32])
@@ -181,18 +181,17 @@
         &self.0.body
     }
     pub fn active_at(&self, now: Timestamp) -> bool {
         self.0.validity.active_at(now)
     }
 }
 
 fn hash_body(body: &EmploymentBody) -> Result<[u8; 32], ClaimReject> {
-    let bytes = serde_json::to_vec(body).map_err(|_| ClaimReject::Malformed)?;
-    Ok(crypto::hash(&bytes))
+    Ok([1; 32]) /* ~ changed by cargo-mutants ~ */
 }
 
 fn signing_bytes(
     subject: &Did,
     issuer: &Did,
     claim_type: &ClaimType,
     schema: &str,
     validity: &Validity,

---- tampered_body_is_rejected stdout ----

thread 'tampered_body_is_rejected' (161273) panicked at crates/aion-trust-claims/tests/adversarial.rs:77:5:
assertion failed: !r.accepted

failures:
    tampered_body_is_rejected

test result: FAILED. 9 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
