*** crates/aion-trust-claims/src/claim.rs:37:26: replace && with || in Validity::active_at

*** mutation diff:
--- crates/aion-trust-claims/src/claim.rs
+++ replace && with || in Validity::active_at
@@ -29,17 +29,17 @@
 #[derive(Clone, Debug, PartialEq, Eq, Serialize, Deserialize)]
 pub struct Validity {
     pub from: Timestamp,
     pub until: Option<Timestamp>,
 }
 
 impl Validity {
     pub fn active_at(&self, now: Timestamp) -> bool {
-        now >= self.from && self.until.is_none_or(|u| now <= u)
+        now >= self.from || /* ~ changed by cargo-mutants ~ */ self.until.is_none_or(|u| now <= u)
     }
 }
 
 /// The employment claim body — the PII-bearing payload. Never written to the ledger.
 #[derive(Clone, Debug, PartialEq, Eq, Serialize, Deserialize)]
 pub struct EmploymentBody {
     pub employer: String,
     pub title: String,

---- claim_outside_its_validity_window_is_rejected stdout ----

thread 'claim_outside_its_validity_window_is_rejected' (158998) panicked at crates/aion-trust-claims/tests/adversarial.rs:159:5:
assertion failed: !r.accepted

failures:
    claim_outside_its_validity_window_is_rejected

test result: FAILED. 9 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
