*** crates/aion-trust-claims/src/claim.rs:37:9: replace Validity::active_at -> bool with false

*** mutation diff:
--- crates/aion-trust-claims/src/claim.rs
+++ replace Validity::active_at -> bool with false
@@ -29,17 +29,17 @@
 #[derive(Clone, Debug, PartialEq, Eq, Serialize, Deserialize)]
 pub struct Validity {
     pub from: Timestamp,
     pub until: Option<Timestamp>,
 }
 
 impl Validity {
     pub fn active_at(&self, now: Timestamp) -> bool {
-        now >= self.from && self.until.is_none_or(|u| now <= u)
+        false /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// The employment claim body — the PII-bearing payload. Never written to the ledger.
 #[derive(Clone, Debug, PartialEq, Eq, Serialize, Deserialize)]
 pub struct EmploymentBody {
     pub employer: String,
     pub title: String,

---- json_round_trip_still_verifies stdout ----

thread 'json_round_trip_still_verifies' (158798) panicked at crates/aion-trust-claims/tests/adversarial.rs:66:5:

---- happy_path_is_accepted stdout ----

thread 'happy_path_is_accepted' (158797) panicked at crates/aion-trust-claims/tests/adversarial.rs:56:5:

failures:
    happy_path_is_accepted
    json_round_trip_still_verifies

test result: FAILED. 8 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
