*** crates/aion-trust-claims/src/presentation.rs:110:5: replace check with ()

*** mutation diff:
--- crates/aion-trust-claims/src/presentation.rs
+++ replace check with ()
@@ -102,21 +102,17 @@
 /// The full result of verifying a presentation. `accepted` iff every check passed.
 #[derive(Clone, Debug, Serialize)]
 pub struct VerificationReport {
     pub accepted: bool,
     pub checks: Vec<Check>,
 }
 
 fn check(checks: &mut Vec<Check>, name: &str, passed: bool, detail: impl Into<String>) {
-    checks.push(Check {
-        name: name.to_string(),
-        passed,
-        detail: detail.into(),
-    });
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 /// Verify a presentation offline. `audience` is the verifier's own did; `now` the current
 /// time; `nonce_already_seen` lets a caller enforce single-use nonces (Phase 4 stores them).
 pub fn verify_presentation(
     p: &Presentation,
     audience: &Did,
     now: Timestamp,

---- forged_claim_signature_is_rejected stdout ----

thread 'forged_claim_signature_is_rejected' (162617) panicked at crates/aion-trust-claims/tests/adversarial.rs:90:5:
assertion failed: !r.accepted

---- unknown_issuer_is_not_accepted stdout ----

thread 'unknown_issuer_is_not_accepted' (162623) panicked at crates/aion-trust-claims/tests/adversarial.rs:110:5:
assertion failed: !r.accepted

---- tampered_body_is_rejected stdout ----

thread 'tampered_body_is_rejected' (162622) panicked at crates/aion-trust-claims/tests/adversarial.rs:77:5:
assertion failed: !r.accepted

failures:
    claim_outside_its_validity_window_is_rejected
    expired_presentation_is_rejected
    forged_claim_signature_is_rejected
    presenting_another_subjects_claim_is_rejected
    replayed_nonce_is_rejected
    tampered_body_is_rejected
    unknown_issuer_is_not_accepted
    wrong_audience_is_rejected

test result: FAILED. 2 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
