*** crates/aion-trust-claims/src/presentation.rs:129:44: replace == with != in verify_presentation

*** mutation diff:
--- crates/aion-trust-claims/src/presentation.rs
+++ replace == with != in verify_presentation
@@ -121,17 +121,17 @@
     audience: &Did,
     now: Timestamp,
     directory: &IssuerDirectory,
     nonce_already_seen: bool,
 ) -> Result<VerificationReport> {
     let mut checks = Vec::new();
     let subject_vk = verifying_key_from_hex(&p.subject_key)?;
 
-    let binds = Did::from_key(&subject_vk) == p.subject_id;
+    let binds = Did::from_key(&subject_vk) != /* ~ changed by cargo-mutants ~ */ p.subject_id;
     check(&mut checks, "subject_id binds to key", binds, p.subject_id.to_string());
     check(&mut checks, "audience matches verifier", &p.audience == audience, p.audience.to_string());
     let unexpired = now >= p.issued_at && now <= p.expires_at;
     check(&mut checks, "unexpired", unexpired, format!("now={}, expires={}", now.0, p.expires_at.0));
     check(&mut checks, "nonce fresh (not replayed)", !nonce_already_seen, p.nonce.clone());
 
     let signing = pres_signing_bytes(
         &p.subject_id, &p.audience, &p.purpose, &decode_nonce(&p.nonce)?,

---- json_round_trip_still_verifies stdout ----

thread 'json_round_trip_still_verifies' (162840) panicked at crates/aion-trust-claims/tests/adversarial.rs:66:5:

---- happy_path_is_accepted stdout ----

thread 'happy_path_is_accepted' (162839) panicked at crates/aion-trust-claims/tests/adversarial.rs:56:5:

failures:
    happy_path_is_accepted
    json_round_trip_still_verifies

test result: FAILED. 8 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
