*** crates/aion-trust-claims/src/presentation.rs:132:40: replace && with || in verify_presentation

*** mutation diff:
--- crates/aion-trust-claims/src/presentation.rs
+++ replace && with || in verify_presentation
@@ -124,17 +124,17 @@
     nonce_already_seen: bool,
 ) -> Result<VerificationReport> {
     let mut checks = Vec::new();
     let subject_vk = verifying_key_from_hex(&p.subject_key)?;
 
     let binds = Did::from_key(&subject_vk) == p.subject_id;
     check(&mut checks, "subject_id binds to key", binds, p.subject_id.to_string());
     check(&mut checks, "audience matches verifier", &p.audience == audience, p.audience.to_string());
-    let unexpired = now >= p.issued_at && now <= p.expires_at;
+    let unexpired = now >= p.issued_at || /* ~ changed by cargo-mutants ~ */ now <= p.expires_at;
     check(&mut checks, "unexpired", unexpired, format!("now={}, expires={}", now.0, p.expires_at.0));
     check(&mut checks, "nonce fresh (not replayed)", !nonce_already_seen, p.nonce.clone());
 
     let signing = pres_signing_bytes(
         &p.subject_id, &p.audience, &p.purpose, &decode_nonce(&p.nonce)?,
         p.issued_at, p.expires_at, &p.claims,
     );
     let sig = decode_array::<64>(&p.subject_signature)?;

---- expired_presentation_is_rejected stdout ----

thread 'expired_presentation_is_rejected' (163247) panicked at crates/aion-trust-claims/tests/adversarial.rs:132:5:
assertion failed: !r.accepted

failures:
    expired_presentation_is_rejected

test result: FAILED. 9 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
