*** crates/aion-trust-claims/src/presentation.rs:134:54: delete ! in verify_presentation

*** mutation diff:
--- crates/aion-trust-claims/src/presentation.rs
+++ delete ! in verify_presentation
@@ -126,17 +126,17 @@
     let mut checks = Vec::new();
     let subject_vk = verifying_key_from_hex(&p.subject_key)?;
 
     let binds = Did::from_key(&subject_vk) == p.subject_id;
     check(&mut checks, "subject_id binds to key", binds, p.subject_id.to_string());
     check(&mut checks, "audience matches verifier", &p.audience == audience, p.audience.to_string());
     let unexpired = now >= p.issued_at && now <= p.expires_at;
     check(&mut checks, "unexpired", unexpired, format!("now={}, expires={}", now.0, p.expires_at.0));
-    check(&mut checks, "nonce fresh (not replayed)", !nonce_already_seen, p.nonce.clone());
+    check(&mut checks, "nonce fresh (not replayed)",  /* ~ changed by cargo-mutants ~ */nonce_already_seen, p.nonce.clone());
 
     let signing = pres_signing_bytes(
         &p.subject_id, &p.audience, &p.purpose, &decode_nonce(&p.nonce)?,
         p.issued_at, p.expires_at, &p.claims,
     );
     let sig = decode_array::<64>(&p.subject_signature)?;
     let sig_ok = subject_vk.verify(&signing, &sig).is_ok();
     check(&mut checks, "subject signature valid", sig_ok, String::new());

---- happy_path_is_accepted stdout ----

thread 'happy_path_is_accepted' (163857) panicked at crates/aion-trust-claims/tests/adversarial.rs:56:5:

---- json_round_trip_still_verifies stdout ----

thread 'json_round_trip_still_verifies' (163858) panicked at crates/aion-trust-claims/tests/adversarial.rs:66:5:

---- replayed_nonce_is_rejected stdout ----

thread 'replayed_nonce_is_rejected' (163860) panicked at crates/aion-trust-claims/tests/adversarial.rs:141:5:
assertion failed: !r.accepted

failures:
    happy_path_is_accepted
    json_round_trip_still_verifies
    replayed_nonce_is_rejected

test result: FAILED. 7 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
