*** crates/aion-trust-claims/src/presentation.rs:159:5: replace verify_one_claim with ()

*** mutation diff:
--- crates/aion-trust-claims/src/presentation.rs
+++ replace verify_one_claim with ()
@@ -151,30 +151,17 @@
 
 fn verify_one_claim(
     checks: &mut Vec<Check>,
     claim: &Claim,
     presenter: &Did,
     now: Timestamp,
     directory: &IssuerDirectory,
 ) {
-    let id = claim.claim_id().as_str().to_string();
-    check(checks, "claim subject matches presenter", &claim.subject_id == presenter, id.clone());
-
-    let Some(issuer_vk) = directory.get(claim.issuer_id()) else {
-        check(checks, "issuer recognized", false, format!("unknown issuer {}", claim.issuer_id()));
-        return;
-    };
-    match claim.verify(issuer_vk) {
-        Ok(verified) => {
-            check(checks, "claim authentic", true, id);
-            check(checks, "claim within validity", verified.active_at(now), String::new());
-        }
-        Err(reject) => check(checks, "claim authentic", false, reject.to_string()),
-    }
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 fn decode_nonce(nonce_hex: &str) -> Result<Vec<u8>> {
     aion_trust_core::encoding::from_hex(nonce_hex)
 }
 
 #[allow(clippy::too_many_arguments)] // mirrors the signed fields; grouping would obscure them
 fn pres_signing_bytes(

---- claim_outside_its_validity_window_is_rejected stdout ----

thread 'claim_outside_its_validity_window_is_rejected' (164059) panicked at crates/aion-trust-claims/tests/adversarial.rs:159:5:
assertion failed: !r.accepted

---- forged_claim_signature_is_rejected stdout ----

thread 'forged_claim_signature_is_rejected' (164061) panicked at crates/aion-trust-claims/tests/adversarial.rs:90:5:
assertion failed: !r.accepted

---- tampered_body_is_rejected stdout ----

thread 'tampered_body_is_rejected' (164066) panicked at crates/aion-trust-claims/tests/adversarial.rs:77:5:
assertion failed: !r.accepted

failures:
    claim_outside_its_validity_window_is_rejected
    forged_claim_signature_is_rejected
    presenting_another_subjects_claim_is_rejected
    tampered_body_is_rejected
    unknown_issuer_is_not_accepted

test result: FAILED. 5 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
