*** crates/aion-trust-claims/src/presentation.rs:160:72: replace == with != in verify_one_claim

*** mutation diff:
--- crates/aion-trust-claims/src/presentation.rs
+++ replace == with != in verify_one_claim
@@ -152,17 +152,17 @@
 fn verify_one_claim(
     checks: &mut Vec<Check>,
     claim: &Claim,
     presenter: &Did,
     now: Timestamp,
     directory: &IssuerDirectory,
 ) {
     let id = claim.claim_id().as_str().to_string();
-    check(checks, "claim subject matches presenter", &claim.subject_id == presenter, id.clone());
+    check(checks, "claim subject matches presenter", &claim.subject_id != /* ~ changed by cargo-mutants ~ */ presenter, id.clone());
 
     let Some(issuer_vk) = directory.get(claim.issuer_id()) else {
         check(checks, "issuer recognized", false, format!("unknown issuer {}", claim.issuer_id()));
         return;
     };
     match claim.verify(issuer_vk) {
         Ok(verified) => {
             check(checks, "claim authentic", true, id);

---- happy_path_is_accepted stdout ----

thread 'happy_path_is_accepted' (164266) panicked at crates/aion-trust-claims/tests/adversarial.rs:56:5:

---- presenting_another_subjects_claim_is_rejected stdout ----

thread 'presenting_another_subjects_claim_is_rejected' (164268) panicked at crates/aion-trust-claims/tests/adversarial.rs:100:5:
assertion failed: !r.accepted

---- json_round_trip_still_verifies stdout ----

thread 'json_round_trip_still_verifies' (164267) panicked at crates/aion-trust-claims/tests/adversarial.rs:66:5:

failures:
    happy_path_is_accepted
    json_round_trip_still_verifies
    presenting_another_subjects_claim_is_rejected

test result: FAILED. 7 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
