*** crates/aion-trust-claims/src/presentation.rs:176:5: replace decode_nonce -> Result<Vec<u8>> with Ok(vec![0])

*** mutation diff:
--- crates/aion-trust-claims/src/presentation.rs
+++ replace decode_nonce -> Result<Vec<u8>> with Ok(vec![0])
@@ -168,17 +168,17 @@
             check(checks, "claim authentic", true, id);
             check(checks, "claim within validity", verified.active_at(now), String::new());
         }
         Err(reject) => check(checks, "claim authentic", false, reject.to_string()),
     }
 }
 
 fn decode_nonce(nonce_hex: &str) -> Result<Vec<u8>> {
-    aion_trust_core::encoding::from_hex(nonce_hex)
+    Ok(vec![0]) /* ~ changed by cargo-mutants ~ */
 }
 
 #[allow(clippy::too_many_arguments)] // mirrors the signed fields; grouping would obscure them
 fn pres_signing_bytes(
     subject: &Did,
     audience: &Did,
     purpose: &str,
     nonce: &[u8],

---- happy_path_is_accepted stdout ----

thread 'happy_path_is_accepted' (164743) panicked at crates/aion-trust-claims/tests/adversarial.rs:56:5:

---- json_round_trip_still_verifies stdout ----

thread 'json_round_trip_still_verifies' (164744) panicked at crates/aion-trust-claims/tests/adversarial.rs:66:5:

failures:
    happy_path_is_accepted
    json_round_trip_still_verifies

test result: FAILED. 8 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
