*** crates/aion-trust-claims/src/presentation.rs:86:9: replace IssuerDirectory::register with ()

*** mutation diff:
--- crates/aion-trust-claims/src/presentation.rs
+++ replace IssuerDirectory::register with ()
@@ -78,17 +78,17 @@
 
 impl IssuerDirectory {
     pub fn new() -> Self {
         Self::default()
     }
 
     /// Recognize an issuer by its public key; it is indexed under the did that key derives.
     pub fn register(&mut self, vk: VerifyingKey) {
-        self.keys.insert(Did::from_key(&vk), vk);
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn get(&self, id: &Did) -> Option<&VerifyingKey> {
         self.keys.get(id)
     }
 }
 
 /// One verification step and whether it passed.

---- claim_outside_its_validity_window_is_rejected stdout ----

thread 'claim_outside_its_validity_window_is_rejected' (162189) panicked at crates/aion-trust-claims/tests/adversarial.rs:160:5:
assertion failed: failed(&r, "claim within validity")

---- happy_path_is_accepted stdout ----

thread 'happy_path_is_accepted' (162192) panicked at crates/aion-trust-claims/tests/adversarial.rs:56:5:

---- json_round_trip_still_verifies stdout ----

thread 'json_round_trip_still_verifies' (162193) panicked at crates/aion-trust-claims/tests/adversarial.rs:66:5:

failures:
    claim_outside_its_validity_window_is_rejected
    forged_claim_signature_is_rejected
    happy_path_is_accepted
    json_round_trip_still_verifies
    tampered_body_is_rejected

test result: FAILED. 5 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
