*** crates/aion-trust-claims/src/presentation.rs:90:9: replace IssuerDirectory::get -> Option<&VerifyingKey> with None

*** mutation diff:
--- crates/aion-trust-claims/src/presentation.rs
+++ replace IssuerDirectory::get -> Option<&VerifyingKey> with None
@@ -82,17 +82,17 @@
     }
 
     /// Recognize an issuer by its public key; it is indexed under the did that key derives.
     pub fn register(&mut self, vk: VerifyingKey) {
         self.keys.insert(Did::from_key(&vk), vk);
     }
 
     pub fn get(&self, id: &Did) -> Option<&VerifyingKey> {
-        self.keys.get(id)
+        None /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// One verification step and whether it passed.
 #[derive(Clone, Debug, Serialize)]
 pub struct Check {
     pub name: String,
     pub passed: bool,

---- forged_claim_signature_is_rejected stdout ----

thread 'forged_claim_signature_is_rejected' (162395) panicked at crates/aion-trust-claims/tests/adversarial.rs:91:5:
assertion failed: failed(&r, "claim authentic")

---- claim_outside_its_validity_window_is_rejected stdout ----

thread 'claim_outside_its_validity_window_is_rejected' (162393) panicked at crates/aion-trust-claims/tests/adversarial.rs:160:5:
assertion failed: failed(&r, "claim within validity")

---- happy_path_is_accepted stdout ----

thread 'happy_path_is_accepted' (162396) panicked at crates/aion-trust-claims/tests/adversarial.rs:56:5:

failures:
    claim_outside_its_validity_window_is_rejected
    forged_claim_signature_is_rejected
    happy_path_is_accepted
    json_round_trip_still_verifies
    tampered_body_is_rejected

test result: FAILED. 5 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
