*** crates/aion-trust-core/src/encoding.rs:15:23: replace & with | in to_hex

*** mutation diff:
--- crates/aion-trust-core/src/encoding.rs
+++ replace & with | in to_hex
@@ -7,17 +7,17 @@
 use crate::error::{Result, TrustError};
 
 const HEX: &[u8; 16] = b"0123456789abcdef";
 
 pub fn to_hex(bytes: &[u8]) -> String {
     let mut s = String::with_capacity(bytes.len() * 2);
     for b in bytes {
         s.push(HEX[(b >> 4) as usize] as char);
-        s.push(HEX[(b & 0x0f) as usize] as char);
+        s.push(HEX[(b | /* ~ changed by cargo-mutants ~ */ 0x0f) as usize] as char);
     }
     s
 }
 
 pub fn from_hex(s: &str) -> Result<Vec<u8>> {
     if s.len() % 2 != 0 {
         return Err(TrustError::Decode("hex length must be even".into()));
     }

*** result: Success
