*** crates/aion-trust-core/src/encoding.rs:21:5: replace from_hex -> Result<Vec<u8>> with Ok(vec![0])

*** mutation diff:
--- crates/aion-trust-core/src/encoding.rs
+++ replace from_hex -> Result<Vec<u8>> with Ok(vec![0])
@@ -13,33 +13,17 @@
     for b in bytes {
         s.push(HEX[(b >> 4) as usize] as char);
         s.push(HEX[(b & 0x0f) as usize] as char);
     }
     s
 }
 
 pub fn from_hex(s: &str) -> Result<Vec<u8>> {
-    if s.len() % 2 != 0 {
-        return Err(TrustError::Decode("hex length must be even".into()));
-    }
-    let nib = |c: u8| -> Result<u8> {
-        match c {
-            b'0'..=b'9' => Ok(c - b'0'),
-            b'a'..=b'f' => Ok(c - b'a' + 10),
-            b'A'..=b'F' => Ok(c - b'A' + 10),
-            _ => Err(TrustError::Decode("invalid hex character".into())),
-        }
-    };
-    let bytes = s.as_bytes();
-    let mut out = Vec::with_capacity(bytes.len() / 2);
-    for pair in bytes.chunks_exact(2) {
-        out.push((nib(pair[0])? << 4) | nib(pair[1])?);
-    }
-    Ok(out)
+    Ok(vec![0]) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Decode a hex string into a fixed-size array, erroring on the wrong length.
 pub fn decode_array<const N: usize>(s: &str) -> Result<[u8; N]> {
     let v = from_hex(s)?;
     v.try_into()
         .map_err(|_| TrustError::Decode(format!("expected {N} bytes")))
 }

*** result: Success
