*** crates/aion-trust-core/src/encoding.rs:26:33: replace - with + in from_hex

*** mutation diff:
--- crates/aion-trust-core/src/encoding.rs
+++ replace - with + in from_hex
@@ -18,17 +18,17 @@
 }
 
 pub fn from_hex(s: &str) -> Result<Vec<u8>> {
     if s.len() % 2 != 0 {
         return Err(TrustError::Decode("hex length must be even".into()));
     }
     let nib = |c: u8| -> Result<u8> {
         match c {
-            b'0'..=b'9' => Ok(c - b'0'),
+            b'0'..=b'9' => Ok(c + /* ~ changed by cargo-mutants ~ */ b'0'),
             b'a'..=b'f' => Ok(c - b'a' + 10),
             b'A'..=b'F' => Ok(c - b'A' + 10),
             _ => Err(TrustError::Decode("invalid hex character".into())),
         }
     };
     let bytes = s.as_bytes();
     let mut out = Vec::with_capacity(bytes.len() / 2);
     for pair in bytes.chunks_exact(2) {

*** result: Success
