*** crates/aion-trust-core/src/encoding.rs:28:13: delete match arm b'A'..= b'F' in from_hex

*** mutation diff:
--- crates/aion-trust-core/src/encoding.rs
+++ delete match arm b'A'..= b'F' in from_hex
@@ -20,17 +20,17 @@
 pub fn from_hex(s: &str) -> Result<Vec<u8>> {
     if s.len() % 2 != 0 {
         return Err(TrustError::Decode("hex length must be even".into()));
     }
     let nib = |c: u8| -> Result<u8> {
         match c {
             b'0'..=b'9' => Ok(c - b'0'),
             b'a'..=b'f' => Ok(c - b'a' + 10),
-            b'A'..=b'F' => Ok(c - b'A' + 10),
+             /* ~ changed by cargo-mutants ~ */
             _ => Err(TrustError::Decode("invalid hex character".into())),
         }
     };
     let bytes = s.as_bytes();
     let mut out = Vec::with_capacity(bytes.len() / 2);
     for pair in bytes.chunks_exact(2) {
         out.push((nib(pair[0])? << 4) | nib(pair[1])?);
     }

*** result: Success
