*** crates/aion-trust-core/src/encoding.rs:35:39: replace | with & in from_hex

*** mutation diff:
--- crates/aion-trust-core/src/encoding.rs
+++ replace | with & in from_hex
@@ -27,17 +27,17 @@
             b'a'..=b'f' => Ok(c - b'a' + 10),
             b'A'..=b'F' => Ok(c - b'A' + 10),
             _ => Err(TrustError::Decode("invalid hex character".into())),
         }
     };
     let bytes = s.as_bytes();
     let mut out = Vec::with_capacity(bytes.len() / 2);
     for pair in bytes.chunks_exact(2) {
-        out.push((nib(pair[0])? << 4) | nib(pair[1])?);
+        out.push((nib(pair[0])? << 4) & /* ~ changed by cargo-mutants ~ */ nib(pair[1])?);
     }
     Ok(out)
 }
 
 /// Decode a hex string into a fixed-size array, erroring on the wrong length.
 pub fn decode_array<const N: usize>(s: &str) -> Result<[u8; N]> {
     let v = from_hex(s)?;
     v.try_into()

*** result: Success
