*** crates/aion-trust-core/src/id.rs:35:9: replace Did::as_bytes -> &[u8] with Vec::leak(Vec::new())

*** mutation diff:
--- crates/aion-trust-core/src/id.rs
+++ replace Did::as_bytes -> &[u8] with Vec::leak(Vec::new())
@@ -27,17 +27,17 @@
         Did(s)
     }
 
     pub fn as_str(&self) -> &str {
         &self.0
     }
 
     pub fn as_bytes(&self) -> &[u8] {
-        self.0.as_bytes()
+        Vec::leak(Vec::new()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl std::fmt::Display for Did {
     fn fmt(&self, f: &mut std::fmt::Formatter<'_>) -> std::fmt::Result {
         f.write_str(&self.0)
     }
 }

*** result: Success
