*** crates/aion-trust-core/src/id.rs:41:9: replace <impl std::fmt::Display for Did>::fmt -> std::fmt::Result with Ok(Default::default())

*** mutation diff:
--- crates/aion-trust-core/src/id.rs
+++ replace <impl std::fmt::Display for Did>::fmt -> std::fmt::Result with Ok(Default::default())
@@ -33,17 +33,17 @@
 
     pub fn as_bytes(&self) -> &[u8] {
         self.0.as_bytes()
     }
 }
 
 impl std::fmt::Display for Did {
     fn fmt(&self, f: &mut std::fmt::Formatter<'_>) -> std::fmt::Result {
-        f.write_str(&self.0)
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// The opaque content id of a claim: hex of `hash(signing_bytes)`. The only handle the
 /// ledger keys claim status on; carries no PII.
 #[derive(Clone, Debug, PartialEq, Eq, Hash, Serialize, Deserialize)]
 #[serde(transparent)]
 pub struct ClaimId(String);

*** result: Success
